ZhangKeLiang0627/EasyGPS/2.Firmware/lib/ESP32-BLE-Combo/BleCombo.cpp
	HIDINPUT(1),         0x02, //     INPUT (Data, Variable, Absolute) ;4 bytes (X,Y,Z,rZ) (8 bytes)

	USAGE_PAGE(1),       0x01, //     USAGE_PAGE (Generic Desktop)
	USAGE(1),            0x33, //     USAGE (rX) Left Trigger
	USAGE(1),            0x34, //     USAGE (rY) Right Trigger
	USAGE(1),            0x36, //     USAGE (analog5) Slider
	USAGE(1),            0x37, //     USAGE (analog6) Dial
	LOGICAL_MINIMUM(1),  0x81, //     LOGICAL_MINIMUM (-127)
	LOGICAL_MAXIMUM(1),  0x7f, //     LOGICAL_MAXIMUM (127)
	REPORT_SIZE(1),      0x08, //     REPORT_SIZE (8)
	//REPORT_COUNT(1),     0x04, //     REPORT_COUNT (4)
	//LOGICAL_MINIMUM(2),  0x01, 0x80, // LOGICAL_MINIMUM (-32767)
	//LOGICAL_MAXIMUM(2),  0xff, 0x7f, // LOGICAL_MAXIMUM (32767)
	//REPORT_SIZE(1),      0x10, //     REPORT_SIZE (16)
	REPORT_COUNT(1),     0x04, //     REPORT_COUNT (4)
	HIDINPUT(1),         0x02, //     INPUT (Data, Variable, Absolute) ;4 bytes rX, rY (8 bytes)

	USAGE_PAGE(1),   	   0x01, //     USAGE_PAGE (Generic Desktop)
	USAGE(1), 		       0x39, //     USAGE (Hat switch)
	USAGE(1), 		       0x39, //     USAGE (Hat switch)
	USAGE(1), 		       0x39, //     USAGE (Hat switch)
	USAGE(1), 		       0x39, //     USAGE (Hat switch)
	LOGICAL_MINIMUM(1),  0x01, //		LOGICAL_MINIMUM (1)
	LOGICAL_MAXIMUM(1),  0x08, //     LOGICAL_MAXIMUM (8)
	REPORT_SIZE(1), 	   0x04, //		REPORT_SIZE (4)
	REPORT_COUNT(1), 	   0x04, //		REPORT_COUNT (4)
	HIDINPUT(1), 		     0x02, //		INPUT (Data, Variable, Absolute) ;2 byte Hat1, Hat2, Hat3, Hat4
	END_COLLECTION(0),         //   END_COLLECTION
	END_COLLECTION(0)          // END_COLLECTION	
};

BleCombo bleDevice;
bool BleCombo::isInitialized = false;

BleCombo::BleCombo(std::string deviceName, std::string deviceManufacturer, uint8_t batteryLevel)
	: _buttons(0), hid(0), deviceName(std::string(deviceName).substr(0, 15)), deviceManufacturer(std::string(deviceManufacturer).substr(0, 15)), batteryLevel(batteryLevel)
{	
}

void BleCombo::begin(void)
{
	if (!isInitialized)
	{
		BLEDevice::init(deviceName);
		BLEServer *pServer = BLEDevice::createServer();
		pServer->setCallbacks(this);

		hid = new BLEHIDDevice(pServer);
		inputKeyboard = hid->inputReport(KEYBOARD_ID); // <-- input REPORTID from report map
		outputKeyboard = hid->outputReport(KEYBOARD_ID);
		inputMediaKeys = hid->inputReport(MEDIA_KEYS_ID);
		inputMouse = hid->inputReport(MOUSE_ID);
		outputMouse = hid->outputReport(MOUSE_ID);
		inputGamepad = hid->inputReport(GAMEPAD_ID);
		outputGamepad = hid->outputReport(GAMEPAD_ID);

		outputKeyboard->setCallbacks(this);
		outputMouse->setCallbacks(this);
		outputGamepad->setCallbacks(this);

		hid->manufacturer()->setValue(deviceManufacturer);

		hid->pnp(0x02, vid, pid, version);
		hid->hidInfo(0x00, 0x01);

#if defined(USE_NIMBLE)

		BLEDevice::setSecurityAuth(true, true, true);

#else

		BLESecurity *pSecurity = new BLESecurity();
		pSecurity->setAuthenticationMode(ESP_LE_AUTH_REQ_SC_MITM_BOND);

#endif // USE_NIMBLE

		hid->reportMap((uint8_t *)_hidReportDescriptor, sizeof(_hidReportDescriptor));
		hid->startServices();

		onStarted(pServer);

		advertising = pServer->getAdvertising();
		advertising->setAppearance(HID_KEYBOARD);
		advertising->addServiceUUID(hid->hidService()->getUUID());
		advertising->setScanResponse(false);
		advertising->start();
		hid->setBatteryLevel(batteryLevel);

		ESP_LOGD(LOG_TAG, "Advertising started!");
		isInitialized = true;
	}
}

void BleCombo::end(void)
{
}

bool BleCombo::isConnected(void)
{
	return this->connected;
}

void BleCombo::setBatteryLevel(uint8_t level)
{
	this->batteryLevel = level;
	if (hid != 0)
		this->hid->setBatteryLevel(this->batteryLevel);
}

// must be called before begin in order to set the name
void BleCombo::setName(std::string deviceName)
{
	this->deviceName = deviceName;
}

/**
 * @brief Sets the waiting time (in milliseconds) between multiple keystrokes in NimBLE mode.
 *
 * @param ms Time in milliseconds
 */
void BleCombo::setDelay(uint32_t ms)
{
	this->_delay_ms = ms;
}

void BleCombo::set_vendor_id(uint16_t vid)
{
	this->vid = vid;
}

void BleCombo::set_product_id(uint16_t pid)
{
	this->pid = pid;
}

void BleCombo::set_version(uint16_t version)
{
	this->version = version;
}

void BleCombo::sendReport(KeyReport *keys)
{
	if (this->isConnected())
	{
		this->inputKeyboard->setValue((uint8_t *)keys, sizeof(KeyReport));
		this->inputKeyboard->notify();
#if defined(USE_NIMBLE)
		// vTaskDelay(delayTicks);
		this->delay_ms(_delay_ms);
#endif // USE_NIMBLE
	}
}

void BleCombo::sendReport(MediaKeyReport *keys)
{
	if (this->isConnected())
	{
		this->inputMediaKeys->setValue((uint8_t *)keys, sizeof(MediaKeyReport));
		this->inputMediaKeys->notify();
#if defined(USE_NIMBLE)
		// vTaskDelay(delayTicks);
		this->delay_ms(_delay_ms);
#endif // USE_NIMBLE
	}
}

extern const uint8_t _asciimap[128] PROGMEM;

#define SHIFT 0x80
const uint8_t _asciimap[128] =
	{
		0x00, // NUL
		0x00, // SOH
		0x00, // STX
		0x00, // ETX
		0x00, // EOT
		0x00, // ENQ
		0x00, // ACK
		0x00, // BEL
		0x2a, // BS	Backspace
		0x2b, // TAB	Tab
		0x28, // LF	Enter
		0x00, // VT
		0x00, // FF
		0x00, // CR
		0x00, // SO
		0x00, // SI
		0x00, // DEL
		0x00, // DC1
		0x00, // DC2
		0x00, // DC3
		0x00, // DC4
		0x00, // NAK
		0x00, // SYN
		0x00, // ETB
		0x00, // CAN
		0x00, // EM
		0x00, // SUB
		0x00, // ESC
		0x00, // FS
		0x00, // GS
		0x00, // RS
		0x00, // US

		0x2c,		  //  ' '
		0x1e | SHIFT, // !
		0x34 | SHIFT, // "
		0x20 | SHIFT, // #
		0x21 | SHIFT, // $
		0x22 | SHIFT, // %
		0x24 | SHIFT, // &
		0x34,		  // '
		0x26 | SHIFT, // (
		0x27 | SHIFT, // )
		0x25 | SHIFT, // *
		0x2e | SHIFT, // +
		0x36,		  // ,
		0x2d,		  // -
		0x37,		  // .
		0x38,		  // /
		0x27,		  // 0
		0x1e,		  // 1
		0x1f,		  // 2
		0x20,		  // 3
		0x21,		  // 4
		0x22,		  // 5
		0x23,		  // 6
		0x24,		  // 7
		0x25,		  // 8
		0x26,		  // 9
		0x33 | SHIFT, // :
		0x33,		  // ;
		0x36 | SHIFT, // <
		0x2e,		  // =
		0x37 | SHIFT, // >
		0x38 | SHIFT, // ?
		0x1f | SHIFT, // @
		0x04 | SHIFT, // A
		0x05 | SHIFT, // B
		0x06 | SHIFT, // C
		0x07 | SHIFT, // D
		0x08 | SHIFT, // E
		0x09 | SHIFT, // F
		0x0a | SHIFT, // G
		0x0b | SHIFT, // H
		0x0c | SHIFT, // I
		0x0d | SHIFT, // J
		0x0e | SHIFT, // K
		0x0f | SHIFT, // L
		0x10 | SHIFT, // M
		0x11 | SHIFT, // N
		0x12 | SHIFT, // O
		0x13 | SHIFT, // P
		0x14 | SHIFT, // Q
		0x15 | SHIFT, // R
		0x16 | SHIFT, // S
		0x17 | SHIFT, // T
		0x18 | SHIFT, // U
		0x19 | SHIFT, // V
		0x1a | SHIFT, // W
		0x1b | SHIFT, // X
		0x1c | SHIFT, // Y
		0x1d | SHIFT, // Z
		0x2f,		  // [
		0x31,		  // bslash
		0x30,		  // ]
		0x23 | SHIFT, // ^
		0x2d | SHIFT, // _
		0x35,		  // `
		0x04,		  // a
		0x05,		  // b
		0x06,		  // c
		0x07,		  // d
		0x08,		  // e
		0x09,		  // f
		0x0a,		  // g
		0x0b,		  // h
		0x0c,		  // i
		0x0d,		  // j
		0x0e,		  // k
		0x0f,		  // l
		0x10,		  // m
		0x11,		  // n
		0x12,		  // o
		0x13,		  // p
		0x14,		  // q
		0x15,		  // r
		0x16,		  // s
		0x17,		  // t
		0x18,		  // u
		0x19,		  // v
		0x1a,		  // w
		0x1b,		  // x
		0x1c,		  // y
		0x1d,		  // z
		0x2f | SHIFT, // {
		0x31 | SHIFT, // |
		0x30 | SHIFT, // }
		0x35 | SHIFT, // ~
		0			  // DEL
};

uint8_t USBPutChar(uint8_t c);

