ZhangKeLiang0627/EasyGPS/2.Firmware/lib/ESP32-BLE-Combo/BleCombo.cpp
void BleCombo::onWrite(BLECharacteristic *me)
{
	uint8_t *value = (uint8_t *)(me->getValue().c_str());
	(void)value;
	ESP_LOGI(LOG_TAG, "special keys: %d", *value);
}

void BleCombo::delay_ms(uint64_t ms)
{
	uint64_t m = esp_timer_get_time();
	if (ms)
	{
		uint64_t e = (m + (ms * 1000));
		if (m > e)
		{ // overflow
			while (esp_timer_get_time() > e)
			{
			}
		}
		while (esp_timer_get_time() < e)
		{
		}
	}
}


void BleCombo::resetButtons() {
	memset(&_buttonsGamepad,0,sizeof(_buttonsGamepad));
	sendReport(&_keyReport);

}
void BleCombo::setAxes(int16_t x, int16_t y, int16_t a1, int16_t a2, int16_t a3, int16_t a4, int16_t a5, int16_t a6, signed char hat1, signed char hat2, signed char hat3, signed char hat4) {

 uint8_t m[26]; // 34
    memset(&m,0,sizeof(m));

    memcpy(&m, &_buttonsGamepad, sizeof(_buttonsGamepad));
    m[16] = x;
    m[17] = y;
    m[18] = a1; // z
    m[19] = a2; // rx
    m[20] = a3; // ry
    m[21] = a4; // rz
    m[22] = a5; // slider
    m[23] = a6; // dial
    m[24] = hat1 | (hat2 << 4); // 1 and 2
    m[25] = hat3 | (hat4 << 4); // 3 and 4 
    
    //memset(&m,0, sizeof(m));
    this->inputGamepad->setValue(m, sizeof(m));
    this->inputGamepad->notify();

}
size_t BleCombo::pressButton(uint8_t b) {
	char index = (b-1) / 8;
  char bit = (b-1) % 8;
  uint8_t bitmask = (1 << bit);

  uint8_t result = _buttonsGamepad[index] | bitmask;
  if (result != _buttonsGamepad[index]) {
    _buttonsGamepad[index] = result;
  }
 return result;

}
size_t BleCombo::releaseButton(uint8_t b) {
 char index = (b-1) / 8;
  char bit = (b-1) % 8;
  uint8_t bitmask = (1 << bit);

  uint64_t result = _buttonsGamepad[index] & ~bitmask;
    _buttonsGamepad[index] = result;
  return result;

}
bool BleCombo::isPressedButton(uint8_t b) {
  char index = (b-1) / 8;
  char bit = (b-1) % 8;
  uint8_t bitmask = (1 << bit);

  if ((bitmask & _buttonsGamepad[index]) > 0)
    return true;
  return false;	
}